; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph0 - mode
	infrared1 - mode
	Star1 - direction
	Star6 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation4 - direction
	Star2 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite2 Star13)
	(have_image Planet8 thermograph0)
	(have_image Star9 infrared1)
	(have_image Star10 infrared1)
	(have_image Phenomenon11 thermograph0)
	(have_image Star12 thermograph0)
	(have_image Star13 infrared1)
	(have_image Phenomenon14 infrared1)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 9
2. (calibrate satellite2 instrument4 groundstation4)
   added: (calibrated instrument4)
   goals met: 0 of 9
3. (turn_to satellite2 planet8 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet8)
   goals met: 0 of 9
4. (take_image satellite2 planet8 instrument4 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 1 of 9
5. (turn_to satellite2 phenomenon14 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 9
6. (take_image satellite2 phenomenon14 instrument4 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 2 of 9
7. (turn_to satellite2 phenomenon11 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 9
8. (turn_to satellite0 star1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star1)
   goals met: 3 of 9
9. (take_image satellite2 phenomenon11 instrument4 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 4 of 9
10. (turn_to satellite2 star10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star10)
   goals met: 4 of 9
11. (take_image satellite2 star10 instrument4 infrared1)
   added: (have_image star10 infrared1)
   goals met: 5 of 9
12. (turn_to satellite2 star12 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star12)
   goals met: 5 of 9
13. (take_image satellite2 star12 instrument4 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 6 of 9
14. (turn_to satellite2 star9 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star9)
   goals met: 6 of 9
15. (take_image satellite2 star9 instrument4 infrared1)
   added: (have_image star9 infrared1)
   goals met: 7 of 9
16. (turn_to satellite2 star13 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star13)
   goals met: 8 of 9
17. (take_image satellite2 star13 instrument4 infrared1)
   added: (have_image star13 infrared1)
   goals met: 9 of 9
